Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: When uploading XLSX files for translation, be aware that only the active worksheet is considered, and there must be at least a column called ``source`` (which contains the source string) and a column called ``target`` (which contains the translation). Additionally there should be the column called ``context`` (which contains the context path of the translation string). If you use the XLSX download for exporting the translations into an Excel workbook, you already get a file with the correct file format.
sv: NÃ¤r du laddar upp XLSX-filer fÃ¶r Ã¶versÃ¤ttning, tÃ¤nk pÃ¥ att endast det aktiva kalkylbladet beaktas och att det mÃ¥ste finnas minst en kolumn med namnet ``source`` (som innehÃ¥ller kÃ¤llstrÃ¤ngen) och en kolumn med namnet ``target`` (som innehÃ¥ller Ã¶versÃ¤ttningen). Dessutom bÃ¶r det finnas en kolumn med namnet ``context`` (som innehÃ¥ller kontextvÃ¤gen fÃ¶r Ã¶versÃ¤ttningsstrÃ¤ngen). Om du anvÃ¤nder XLSX-nedladdningen fÃ¶r att exportera Ã¶versÃ¤ttningarna till en Excel-arbetsbok fÃ¥r du redan en fil med rÃ¤tt filformat.

source: Flat XML files
sv: Flata XML-filer

source: The tag and attribute names can now be customized using :ref:`file_format_params`.
sv: Tagg- och attributnamnen kan nu anpassas med hjÃ¤lp av :ref:`file_format_params`.

source: Example of flat XML files:
sv: Exempel pÃ¥ platta XML-filer:

source: `Flat XML file`
sv: `Platt XML-fil`

source: Support for this format is under development. Some features might not yet be available and the behavior can change between releases. Feedback from testing is welcome.
sv: StÃ¶d fÃ¶r detta format Ã¤r under utveckling. Vissa funktioner kanske Ã¤nnu inte Ã¤r tillgÃ¤ngliga och funktionen kan Ã¤ndras mellan olika versioner. Feedback frÃ¥n testning Ã¤r vÃ¤lkommen.

source: Fluent is a monolingual text format that focuses on asymmetric localization: a simple string in one language can map to a complex multi-variant translation in another language.
sv: Fluent Ã¤r ett ensprÃ¥kigt textformat som fokuserar pÃ¥ asymmetrisk lokalisering: en enkel strÃ¤ng pÃ¥ ett sprÃ¥k kan mappas till en komplex Ã¶versÃ¤ttning med flera varianter pÃ¥ ett annat sprÃ¥k.

source: `Project Fluent website <https://projectfluent.org/>`_
sv: `Projekt Fluents webbplats <https://projectfluent.org/>`_

source: `Fluent file`
sv: `Flytande fil`

source: File format used when translating Format.JS and React-Intl applications.
sv: Filformat som anvÃ¤nds vid Ã¶versÃ¤ttning av Format.JS- och React-Intl-applikationer.

source: `Format.JS JSON file`
sv: `Format.JS JSON-fil`

source: Most widely used format for translating libre software.
sv: Det mest anvÃ¤nda formatet fÃ¶r Ã¶versÃ¤ttning av fri programvara.

source: Contextual info stored in the file is supported by adjusting its headers or linking to corresponding source files.
sv: Kontextuell information som lagras i filen stÃ¶ds genom att justera dess rubriker eller lÃ¤nka till motsvarande kÃ¤llfiler.

source: `Gettext on Wikipedia <https://en.wikipedia.org/wiki/Gettext>`_
sv: `Gettext pÃ¥ Wikipedia <https://en.wikipedia.org/wiki/Gettext>`_

source: Showing source string change
sv: Visar Ã¤ndring av kÃ¤llstrÃ¤ng

source: Weblate can extract previous source strings from the PO files if present and show the string difference for strings needing editing based on that. To include these, :program:`msgmerge` has to be executed with ``--previous`` and the resulting PO file then contains lines such as:
sv: Weblate kan extrahera tidigare kÃ¤llstrÃ¤ngar frÃ¥n PO-filerna om sÃ¥dana finns och visa strÃ¤ngskillnaden fÃ¶r strÃ¤ngar som behÃ¶ver redigeras baserat pÃ¥ det. FÃ¶r att inkludera dessa mÃ¥ste :program:`msgmerge` kÃ¶ras med ``--previous`` och den resulterande PO-filen innehÃ¥ller dÃ¥ rader som:

source: PO file header
sv: PO-filens rubrik

source: The header of the PO file is automatically maintained by Weblate. Optionally it can include :ref:`component-report_source_bugs` and :ref:`project-set_language_team`.
sv: Rubriken i PO-filen underhÃ¥lls automatiskt av Weblate. Valfritt kan den inkludera :ref:`component-report_source_bugs` och :ref:`project-set_language_team`.

source: The header comments also can be updated to contain author names using :ref:`addon-weblate.gettext.authors`.
sv: Rubrikkommentarerna kan ocksÃ¥ uppdateras sÃ¥ att de innehÃ¥ller fÃ¶rfattarnamn med hjÃ¤lp av :ref:`addon-weblate.gettext.authors`.

source: Line wrapping
sv: Radbrytning

source: The line wrapping mostly matches GNU gettext behavior. Both the wrapping algorithm in the GNU gettext and the Unicode data the wrapping is based on evolve which might cause differences in some corner cases.
sv: Radbrytningen motsvarar i stort sett GNU gettexts beteende. BÃ¥de radbrytningsalgoritmen i GNU gettext och Unicode-data som radbrytningen baseras pÃ¥ utvecklas, vilket kan orsaka skillnader i vissa specialfall.

source: The wrapping width can be configured using the ``po_line_wrap`` parameter, see :ref:`file_format_params`.
sv: Ombrytningsbredden kan konfigureras med parametern ``po_line_wrap``, se :ref:`file_format_params`.

source: Generating matching MO files
sv: Skapa matchande MO-filer

source: In case MO files are kept in the repository together with PO files, :ref:`addon-weblate.gettext.mo` can be used to keep them up-to-date with PO files.
sv: Om MO-filer sparas i arkivet tillsammans med PO-filer kan :ref:`addon-weblate.gettext.mo` anvÃ¤ndas fÃ¶r att hÃ¥lla dem uppdaterade med PO-filerna.

source: Updating PO files from the POT file
sv: Uppdatera PO-filer frÃ¥n POT-filen

source: :ref:`addon-weblate.gettext.msgmerge` can be used to update PO files from the POT file, see :ref:`updating-target-files`.
sv: :ref:`addon-weblate.gettext.msgmerge` kan anvÃ¤ndas fÃ¶r att uppdatera PO-filer frÃ¥n POT-filen, se :ref:`updating-target-files`.

source: Monolingual gettext
sv: EnsprÃ¥kig gettext

source: Some projects decide to use gettext as monolingual formatsâthey code just the IDs in their source code and the string then needs to be translated to all languages, including English. This is supported, though you have to choose this file format explicitly when importing components into Weblate.
sv: Vissa projekt vÃ¤ljer att anvÃ¤nda gettext som ensprÃ¥kiga format â de kodar bara ID:n i sin kÃ¤llkod och strÃ¤ngen mÃ¥ste sedan Ã¶versÃ¤ttas till alla sprÃ¥k, inklusive engelska. Detta stÃ¶ds, men du mÃ¥ste vÃ¤lja detta filformat uttryckligen nÃ¤r du importerar komponenter till Weblate.

source: The bilingual gettext PO file typically looks like this:
sv: Den tvÃ¥sprÃ¥kiga gettext PO-filen ser vanligtvis ut sÃ¥ hÃ¤r:

source: The monolingual gettext PO file typically looks like this:
sv: Den ensprÃ¥kiga gettext PO-filen ser vanligtvis ut sÃ¥ hÃ¤r:

source: While the base language file will be:
sv: Basens sprÃ¥kfil kommer att vara:

source: Typical Weblate :ref:`component` for bilingual gettext
sv: Typisk Weblate :ref:`component` fÃ¶r tvÃ¥sprÃ¥kig gettext

source: `Gettext PO file`
sv: `Gettext PO-fil`

source: Typical Weblate :ref:`component` for monolingual gettext
sv: Typisk Weblate :ref:`component` fÃ¶r ensprÃ¥kig gettext

source: `Gettext PO file (monolingual)`
sv: `Gettext PO-fil (ensprÃ¥kig)`

source: :ref:`file_format_params` with the pattern `po_*` can be used to configure the behavior of the gettext format.
sv: :ref:`file_format_params` med mÃ¶nstret `po_*` kan anvÃ¤ndas fÃ¶r att konfigurera beteendet fÃ¶r gettext-formatet.

source: go-i18n JSON files
sv: go-i18n JSON-filer

source: Support for v2 variant of this format was added.
sv: StÃ¶d fÃ¶r v2-varianten av detta format har lagts till.

source: go-i18n translations are monolingual, so it is recommended to specify a base file with (what is most often the) English strings.
sv: go-i18n-Ã¶versÃ¤ttningar Ã¤r ensprÃ¥kiga, sÃ¥ det rekommenderas att ange en basfil med (oftast) engelska strÃ¤ngar.

source: Weblate supports the go-i18n JSON v1 and v2 variants. Please choose correct file format matching your environment.
sv: Weblate stÃ¶der go-i18n JSON v1- och v2-varianterna. VÃ¤lj rÃ¤tt filformat som passar din miljÃ¶.

source: Example file v1:
sv: Exempelfil v1:

source: Example file v2:
sv: Exempelfil v2:

source: Typical Weblate :ref:`component` for v1
sv: Typisk Weblate :ref:`component` fÃ¶r v1

source: `go-i18n v1 JSON file`
sv: `go-i18n v1 JSON-fil`

source: Typical Weblate :ref:`component` for v2
sv: Typisk Weblate :ref:`component` fÃ¶r v2

source: `go-i18n v2 JSON file`
sv: `go-i18n v2 JSON-fil`

source: gotext JSON files
sv: gotext JSON-filer

source: gotext translations are monolingual, so it is recommended to specify a base file with (what is most often the) English strings.
sv: gotext-Ã¶versÃ¤ttningar Ã¤r ensprÃ¥kiga, sÃ¥ det rekommenderas att ange en basfil med (oftast) engelska strÃ¤ngar.

source: `I18n in Go: Managing Translations <https://www.alexedwards.net/blog/i18n-managing-translations>`_
sv: `I18n i Go: Hantera Ã¶versÃ¤ttningar <https://www.alexedwards.net/blog/i18n-managing-translations>`_

source: `gotext JSON file`
sv: `gotext JSON-fil`

source: Native GWT format for translations.
sv: Inbyggt GWT-format fÃ¶r Ã¶versÃ¤ttningar.

source: GWT properties are usually used as monolingual translations.
sv: GWT-egenskaper anvÃ¤nds vanligtvis som ensprÃ¥kiga Ã¶versÃ¤ttningar.

source: `GWT localization guide <https://www.gwtproject.org/doc/latest/DevGuideI18n.html>`_
sv: `GWT-lokaliseringsguide <https://www.gwtproject.org/doc/latest/DevGuideI18n.html>`_

source: `GWT Properties`
sv: `GWT-egenskaper`

source: HTML files
sv: HTML-filer

source: The translatable content is extracted from the HTML files and offered for the translation.
sv: Det Ã¶versÃ¤ttningsbara innehÃ¥llet extraheras frÃ¥n HTML-filerna och erbjuds fÃ¶r Ã¶versÃ¤ttning.

source: Unlike most other formats, the changes in the translation files will not be imported to Weblate because it can not be done reliably. The source of truth for the translations is Weblate not the translated file.
sv: Till skillnad frÃ¥n de flesta andra format kommer Ã¤ndringarna i Ã¶versÃ¤ttningsfilerna inte att importeras till Weblate, eftersom det inte kan gÃ¶ras pÃ¥ ett tillfÃ¶rlitligt sÃ¤tt. KÃ¤llan till Ã¶versÃ¤ttningarna Ã¤r Weblate, inte den Ã¶versatta filen.

source: `HTML file`
sv: `HTML-fil`

source: i18next JSON files
sv: i18next JSON-filer

source: Support for v4 variant of this format was added.
sv: StÃ¶d fÃ¶r v4-varianten av detta format har lagts till.

source: In case you use plurals, it is recommended to use v4 as that aligned plural handling with CLDR. Older versions have different plural rules for some languages which are not correct.
sv: Om du anvÃ¤nder pluralformer rekommenderas det att anvÃ¤nda v4, eftersom den Ã¤r anpassad till CLDR:s hantering av pluralformer. Ãldre versioner har olika pluralregler fÃ¶r vissa sprÃ¥k som inte Ã¤r korrekta.

source: i18next is an internationalization framework written in and for JavaScript. Weblate supports its localization files with features such as plurals.
sv: i18next Ã¤r ett internationaliseringsramverk skrivet i och fÃ¶r JavaScript. Weblate stÃ¶der dess lokaliseringsfiler med funktioner som pluralformer.

source: i18next translations are monolingual, so it is recommended to specify a base file with (what is most often the) English strings.
sv: i18next-Ã¶versÃ¤ttningar Ã¤r ensprÃ¥kiga, sÃ¥ det rekommenderas att ange en basfil med (oftast) engelska strÃ¤ngar.

source: Choose this format if unsure. It stores plurals using standard CLDR suffixes.
sv: VÃ¤lj detta format om du Ã¤r osÃ¤ker. Det lagrar pluralformer med hjÃ¤lp av standard CLDR-suffix.

source: Use for legacy projects which are using numeric suffixes for plurals.
sv: AnvÃ¤nds fÃ¶r Ã¤ldre projekt som anvÃ¤nder numeriska suffix fÃ¶r pluralformer.

source: The v2 and v1 variants are mostly compatible with v3, with exception of how plurals are handled.
sv: Varianterna v2 och v1 Ã¤r i stort sett kompatibla med v3, med undantag fÃ¶r hur pluralformer hanteras.

source: `i18next JSON file v3`
sv: `i18next JSON-fil v3`

source: The translatable content is extracted from the Adobe InDesign Markup Language files and offered for the translation.
sv: Det Ã¶versÃ¤ttningsbara innehÃ¥llet extraheras frÃ¥n Adobe InDesign Markup Language-filerna och erbjuds fÃ¶r Ã¶versÃ¤ttning.

source: `IDML file`
sv: `IDML-fil`

source: INI translations
sv: INI-översättningar

source: INI file format for translations. Weblate currently supports several variants of JSON translations:
sv: INI-filformat fÃ¶r Ã¶versÃ¤ttningar. Weblate stÃ¶der fÃ¶r nÃ¤rvarande flera varianter av JSON-Ã¶versÃ¤ttningar:

source: Monolingual INI files
sv: EnsprÃ¥kiga INI-filer

source: INI translations are usually used as monolingual translations.
sv: INI-Ã¶versÃ¤ttningar anvÃ¤nds vanligtvis som ensprÃ¥kiga Ã¶versÃ¤ttningar.

source: Weblate only extracts keys from sections within an INI file. In case your INI file lacks sections, you might want to use :ref:`joomla` or :ref:`javaprop` instead.
sv: Weblate extraherar endast nycklar frÃ¥n sektioner i en INI-fil. Om din INI-fil saknar sektioner kan du istÃ¤llet anvÃ¤nda :ref:`joomla` eller :ref:`javaprop`.

source: `INI File`
sv: `INI-fil`

source: Inno Setup INI translations
sv: Inno Setup INI-översättningar

source: Inno Setup INI file format for translations.
sv: Inno Setup INI-filformat fÃ¶r Ã¶versÃ¤ttningar.

source: Inno Setup INI translations are usually used as monolingual translations.
sv: Inno Setup INI-Ã¶versÃ¤ttningar anvÃ¤nds vanligtvis som ensprÃ¥kiga Ã¶versÃ¤ttningar.

source: The only notable difference to :ref:`ini` is in supporting ``%n`` and ``%t`` placeholders for line break and tab.
sv: Den enda mÃ¤rkbara skillnaden jÃ¤mfÃ¶rt med :ref:`ini` Ã¤r stÃ¶det fÃ¶r platshÃ¥llarna ``%n`` och ``%t`` fÃ¶r radbrytning och tabb.

source: Only Unicode files (``.islu``) are currently supported, ANSI variant (``.isl``) is currently not supported.
sv: Endast Unicode-filer (``.islu``) stÃ¶ds fÃ¶r nÃ¤rvarande, ANSI-varianten (``.isl``) stÃ¶ds inte fÃ¶r nÃ¤rvarande.

source: `Inno Setup INI File`
sv: `Inno Setup INI-fil`

source: Java properties
sv: Java-egenskaper

source: Native Java format for translations.
sv: Inbyggt Java-format fÃ¶r Ã¶versÃ¤ttningar.

source: Java properties are usually used as monolingual translations.
sv: Java-egenskaper anvÃ¤nds vanligtvis som ensprÃ¥kiga Ã¶versÃ¤ttningar.

source: Weblate supports ISO-8859-1, UTF-8 and UTF-16 variants of this format. All of them support storing all Unicode characters, it is just differently encoded. In the ISO-8859-1, the Unicode escape sequences are used (for example ``zkou\u0161ka``), all others encode characters directly either in UTF-8 or UTF-16.
sv: Weblate stÃ¶der ISO-8859-1-, UTF-8- och UTF-16-varianter av detta format. Alla stÃ¶der lagring av alla Unicode-tecken, men kodningen skiljer sig Ã¥t. I ISO-8859-1 anvÃ¤nds Unicode-escapeseekvenser (till exempel ``zkou\u0161ka``), medan alla andra kodar tecken direkt i antingen UTF-8 eller UTF-16.

source: Loading escape sequences works in UTF-8 mode as well, so please be careful choosing the correct encoding set to match your application needs.
sv: InlÃ¤sning av escape-sekvenser fungerar Ã¤ven i UTF-8-lÃ¤ge, sÃ¥ var noga med att vÃ¤lja rÃ¤tt kodningsuppsÃ¤ttning som passar dina applikationsbehov.

source: `Java properties on Wikipedia <https://en.wikipedia.org/wiki/.properties>`_
sv: `Java-egenskaper pÃ¥ Wikipedia <https://en.wikipedia.org/wiki/.properties>`_

source: Joomla translations
sv: Joomla-översättningar

source: Native Joomla format for translations.
sv: Inbyggt Joomla-format fÃ¶r Ã¶versÃ¤ttningar.

source: Joomla translations are usually used as monolingual translations.
sv: Joomla-Ã¶versÃ¤ttningar anvÃ¤nds vanligtvis som ensprÃ¥kiga Ã¶versÃ¤ttningar.

source: `Joomla Language File`
sv: `Joomla-sprÃ¥kfil`

source: JSON files
sv: JSON-filer

source: The structure of JSON file is properly preserved even for complex situations which were broken in prior releases.
sv: Strukturen i JSON-filen bevaras korrekt Ã¤ven i komplexa situationer som inte fungerade i tidigare versioner.

source: JSON format is used mostly for translating applications implemented in JavaScript.
sv: JSON-formatet anvÃ¤nds frÃ¤mst fÃ¶r att Ã¶versÃ¤tta applikationer som Ã¤r implementerade i JavaScript.

source: Weblate currently supports several variants of JSON translations:
sv: Weblate stÃ¶der fÃ¶r nÃ¤rvarande flera varianter av JSON-Ã¶versÃ¤ttningar:

source: Simple key / value files, used for example by `vue-i18n` or `react-intl`.
sv: Enkla nyckel-/vÃ¤rdefiler, som anvÃ¤nds till exempel av `vue-i18n` eller `react-intl`.

source: Files with nested keys.
sv: Filer med kapslade nycklar.

source: JSON translations are usually monolingual, so it is recommended to specify a base file with (what is most often the) English strings.
sv: JSON-Ã¶versÃ¤ttningar Ã¤r vanligtvis ensprÃ¥kiga, sÃ¥ det rekommenderas att ange en basfil med (oftast) engelska strÃ¤ngar.

source: The :guilabel:`JSON file` and :guilabel:`JSON nested structure file` can both handle same type of files. Both preserve existing JSON structure when translating.
sv: :guilabel:`JSON-filen` och :guilabel:`JSON-filen med kapslad struktur` kan bÃ¥da hantera samma typ av filer. BÃ¥da bevarar befintlig JSON-struktur vid Ã¶versÃ¤ttning.

source: The only difference between them is when adding new strings using Weblate. The nested structure format parses the newly added key and inserts the new string into the matching structure. For example ``app.name`` key is inserted as:
sv: Den enda skillnaden mellan dem Ã¤r nÃ¤r man lÃ¤gger till nya strÃ¤ngar med Weblate. Det kapslade strukturformatet analyserar den nyligen tillagda nyckeln och infogar den nya strÃ¤ngen i den matchande strukturen. Till exempel infogas nyckeln ``app.name`` som:

source: Nested files are supported as well (see above for requirements), such a file can look like:
sv: NÃ¤stlade filer stÃ¶ds ocksÃ¥ (se ovan fÃ¶r krav), en sÃ¥dan fil kan se ut sÃ¥ hÃ¤r:

source: `JSON nested structure file`
sv: `JSON-fil med nÃ¤stlad struktur`

source: :ref:`file_format_params` with the pattern `json_*` can be used to configure the behavior of the JSON format.
sv: :ref:`file_format_params` med mÃ¶nstret `json_*` kan anvÃ¤ndas fÃ¶r att konfigurera beteendet fÃ¶r JSON-formatet.

source: The Laravel PHP localization files are supported as well with plurals:
sv: Laravel PHP-lokaliseringsfilerna stÃ¶ds ocksÃ¥ med pluralformer:

source: The translation keys no longer include PHP structure and only contain the actual key.
sv: ÃversÃ¤ttningsnycklarna innehÃ¥ller inte lÃ¤ngre PHP-strukturen utan endast sjÃ¤lva nyckeln.

source: `Localization in Laravel`_
sv: `Lokalisering i Laravel`_

source: `Laravel PHP strings`
sv: Laravel PHP-strÃ¤ngar

source: Markdown files
sv: Markdown-filer

source: The translatable content is extracted from the Markdown files and offered for the translation.
sv: Det Ã¶versÃ¤ttningsbara innehÃ¥llet extraheras frÃ¥n Markdown-filerna och erbjuds fÃ¶r Ã¶versÃ¤ttning.

source: `Markdown file`
sv: `Markdown-fil`

source: draggable/i18n lang files
sv: draggable/i18n-sprÃ¥kfiler

source: The library was former published as mi18n.
sv: Biblioteket publicerades tidigare som mi18n.

source: File format used for JavaScript localization by `draggable/i18n`_. Syntactically it matches :ref:`javaprop`.
sv: Filformat som anvÃ¤nds fÃ¶r JavaScript-lokalisering av `draggable/i18n`_. Syntaktiskt matchar det :ref:`javaprop`.

source: `draggabble/i18n lang file`
sv: `draggabble/i18n lang-fil`

source: Mobile Kotlin resources
sv: Mobile Kotlin-resurser

source: A variant of :doc:`/formats/android`. It differs in plural tag (``plural`` is used instead of ``plurals``) and escaping.
sv: En variant av :doc:`/formats/android`. Den skiljer sig Ã¥t i plural-taggen (``plural`` anvÃ¤nds istÃ¤llet fÃ¶r ``plurals``) och escapning.

source: `Mobile Kotlin resources <https://github.com/icerockdev/moko-resources>`_
sv: `Mobila Kotlin-resurser <https://github.com/icerockdev/moko-resources>`_

source: `Mobile Kotlin Resource`
sv: `Mobil Kotlin-resurs`

source: Nextcloud Apps JSON files
sv: Nextcloud Apps JSON-filer

source: JSON-based format used in Nextcloud Apps that use JavaScript and HTML.
sv: JSON-baserat format som anvÃ¤nds i Nextcloud-appar som anvÃ¤nder JavaScript och HTML.

source: `Nextcloud JSON file`
sv: `Nextcloud JSON-fil`

source: The translatable content is extracted from the OpenDocument files and offered for the translation.
sv: Det Ã¶versÃ¤ttningsbara innehÃ¥llet extraheras frÃ¥n OpenDocument-filerna och erbjuds fÃ¶r Ã¶versÃ¤ttning.

source: `OpenDocument file`
sv: `OpenDocument-fil`

source: PHP translations are usually monolingual, so it is recommended to specify a base file with (what is most often the) English strings.
sv: PHP-Ã¶versÃ¤ttningar Ã¤r vanligtvis ensprÃ¥kiga, sÃ¥ det rekommenderas att ange en basfil med (oftast) engelska strÃ¤ngar.

source: Weblate currently supports several variants of PHP translations:
sv: Weblate stÃ¶der fÃ¶r nÃ¤rvarande flera varianter av PHP-Ã¶versÃ¤ttningar:

source: Monolingual PHP strings in various syntax
sv: EnsprÃ¥kiga PHP-strÃ¤ngar i olika syntaxer

source: `PHP strings`
sv: `PHP-strÃ¤ngar`

source: Translation format used in Qt based applications.
sv: ÃversÃ¤ttningsformat som anvÃ¤nds i Qt-baserade applikationer.

source: Qt Linguist files are used as both bilingual and monolingual translations.
sv: Qt Linguist-filer anvÃ¤nds bÃ¥de fÃ¶r tvÃ¥sprÃ¥kiga och ensprÃ¥kiga Ã¶versÃ¤ttningar.

source: `Qt Linguist manual <https://doc.qt.io/qt-6/qtlinguist-index.html>`_
sv: `Qt Linguist-handbok <https://doc.qt.io/qt-6/qtlinguist-index.html>`_

source: Typical Weblate :ref:`component` when using as bilingual
sv: Typisk Weblate :ref:`component` vid anvÃ¤ndning som tvÃ¥sprÃ¥kig

source: `Qt Linguist Translation File`
sv: `Qt Linguist-Ã¶versÃ¤ttningsfil`

source: Typical Weblate :ref:`component` when using as monolingual
sv: Typisk Weblate :ref:`component` vid anvÃ¤ndning som ensprÃ¥kig

source: JavaScript Resource Files (RESJSON)
sv: JavaScript-resursfiler (RESJSON)

source: JSON-based format used in Windows Store apps that use JavaScript and HTML. Sometimes it is also referred as Windows JSON.
sv: JSON-baserat format som anvÃ¤nds i Windows Store-appar som anvÃ¤nder JavaScript och HTML. Ibland kallas det Ã¤ven Windows JSON.

source: `RESJSON file`
sv: `RESJSON-fil`

source: ResourceDictionary files
sv: ResourceDictionary-filer

source: ResourceDictionary is a monolingual XML file format used to package localizable string resources for Windows Presentation Foundation (WPF) applications.
sv: ResourceDictionary Ã¤r ett ensprÃ¥kigt XML-filformat som anvÃ¤nds fÃ¶r att paketera lokaliserbara strÃ¤ngresurser fÃ¶r Windows Presentation Foundation (WPF)-applikationer.

source: `ResourceDictionary file`
sv: `ResourceDictionary-fil`

source: .NET resource files (RESX, RESW)
sv: .NET-resursfiler (RESX, RESW)

source: A .NET XML resource file employs a monolingual XML file format used in Microsoft .NET applications.
sv: En .NET XML-resursfil anvÃ¤nder ett ensprÃ¥kigt XML-filformat som anvÃ¤nds i Microsoft .NET-applikationer.

source: It can use ``.resx`` or ``.resw`` extension. Despite the difference of file extension, the ``.resw`` file format is identical to the ``.resx`` file format, except that ``.resw`` files may contain only strings and file paths.
sv: Den kan anvÃ¤nda filÃ¤ndelsen ``.resx`` eller ``.resw``. Trots skillnaden i filÃ¤ndelse Ã¤r filformatet ``.resw`` identiskt med filformatet ``.resx``, fÃ¶rutom att ``.resw``-filer endast kan innehÃ¥lla strÃ¤ngar och filsÃ¶kvÃ¤gar.

source: `.NET resource file`
sv: `.NET-resursfil`

source: Ruby YAML files
sv: Ruby YAML-filer

source: Ruby i18n YAML files with language as root node.
sv: Ruby i18n YAML-filer med sprÃ¥k som rotnod.

source: Example Ruby i18n YAML file:
sv: Exempel pÃ¥ Ruby i18n YAML-fil:

source: `Ruby YAML file`
sv: `Ruby YAML-fil`
